## Plan output

```
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_region.current: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.hosted_zones.aws_cloudwatch_log_resource_policy.this["document_transfer"]: Refreshing state... [id=illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes]
module.hosted_zones.module.hosted_zones.aws_route53_zone.this["document_transfer"]: Refreshing state... [id=Z02064831UC6N7D03DSNG]
module.bastion.data.aws_region.current: Reading...
module.hosted_zones.aws_route53_query_log.this["document_transfer"]: Refreshing state... [id=fe638ff4-a024-4c13-9df3-3ea796f5fd31]
module.microservice.module.service.aws_ssm_parameter.version["this"]: Refreshing state... [id=/illinois-getchildcare/staging/document-transfer/version]
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_partition.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/document-transfer/otel]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.data.aws_lambda_functions.all: Reading...
module.microservice.module.secrets.data.aws_partition.current: Reading...
module.microservice.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_partition.current: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.data.aws_partition.current: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c4c542a315b431d2]
module.microservice.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.microservice.module.worker.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/doc-transfer-worker/otel]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.aws_s3_bucket.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.microservice.module.worker.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-execution]
module.microservice.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.microservice.module.secrets.data.aws_caller_identity.identity: Reading...
module.microservice.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-task]
module.microservice.module.service.data.aws_region.current: Reading...
module.microservice.module.worker.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-task]
module.microservice.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z02064831UC6N7D03DSNG]
module.microservice.module.worker.data.aws_caller_identity.identity: Reading...
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.microservice.module.database.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Reading...
module.microservice.module.worker.data.aws_region.current: Reading...
module.microservice.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_elb_service_account.current: Reading...
module.microservice.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.microservice.module.worker.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-doc-transfer-worker]
module.backend.aws_s3_bucket.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.microservice.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_lambda_functions.all: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.available: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.backend.data.aws_caller_identity.identity: Reading...
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.data.aws_region.current: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.microservice.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.microservice.module.service.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-execution]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.secrets.data.aws_region.current: Reading...
module.microservice.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.bastion.data.aws_ami.bastion: Reading...
module.logging.module.s3.data.aws_region.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.microservice.module.worker.data.aws_partition.current: Reading...
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:891377151751:certificate/8ac88d33-64f4-45c5-bc82-610cf16b1a70]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.microservice.module.database.module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=il-gcc-staging-doc-trans-db-mon-20250509154744419300000001]
module.microservice.module.service.aws_kms_key.fargate: Refreshing state... [id=d654dd34-e8d2-4218-ab18-512c5c6bcee4]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.microservice.module.database.aws_kms_key.database: Refreshing state... [id=c44eda7e-7b5d-43b1-977e-f4d7e580e0db]
module.bastion.aws_kms_key.this: Refreshing state... [id=aa8437fc-f46d-49ac-99a2-1c0b0bbddfd6]
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.microservice.module.worker.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.logging.module.s3.aws_s3_bucket_versioning.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_public_access_block.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_ownership_controls.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.backend.aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_kms_key.backend: Refreshing state... [id=e12d42f7-5c01-4df2-8f70-8647f8e51d7e]
module.backend.aws_s3_bucket_policy.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_lifecycle_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_versioning.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.microservice.module.secrets.aws_kms_key.secrets: Refreshing state... [id=2a8b7a60-70dc-4812-b0c2-ea121056ef55]
module.microservice.module.worker.aws_kms_key.fargate: Refreshing state... [id=2c1ab5d7-6ad2-45d3-854f-52b71401de48]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=2435597572]
module.microservice.module.service.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.data.aws_lambda_function.datadog["this"]: Reading...
module.backend.aws_s3_bucket_logging.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.aws_s3_bucket_object_lock_configuration.lock["this"]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.aws_kms_key.logs: Refreshing state... [id=c9834240-1993-4623-9c60-ab21bd6a7269]
module.microservice.module.service.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer]
module.bastion.aws_kms_alias.this: Refreshing state... [id=alias/illinois-getchildcare/staging/bastion]
module.microservice.module.database.aws_kms_alias.database: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/database]
module.microservice.module.database.module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=il-gcc-staging-doc-trans-db-mon-20250509154744419300000001-20250509154744925500000003]
module.bastion.data.aws_ami.bastion: Read complete after 1s [id=ami-0953476d60561c955]
module.backend.aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_kms_alias.backend: Refreshing state... [id=alias/illinois-getchildcare/staging/backend]
module.backend.aws_dynamodb_table.tfstate_lock: Refreshing state... [id=staging.tfstate]
module.microservice.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/secrets]
module.microservice.module.worker.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/doc-transfer-worker]
module.microservice.module.service.aws_route53_record.endpoint_validation["staging.document-transfer.cfa.codes"]: Refreshing state... [id=Z02064831UC6N7D03DSNG__1614a409f9459d5606d9aec8c0d3cee6.staging.document-transfer.cfa.codes._CNAME]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02414c145b73a1bf2]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0506da06c23d3d9fe]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09c173bedb5ad4f50]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/illinois-getchildcare/staging/logs]
module.logging.aws_cloudwatch_log_group.logs["document-transfer-dns"]: Refreshing state... [id=/aws/route53/staging.document-transfer.cfa.codes]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=1133955049]
module.vpc.aws_vpc_peering_connection.peer["aptible"]: Refreshing state... [id=pcx-0abf9e62533f46ca6]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08ef5814b92528122]
module.microservice.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ebea172f63ea7b36]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06a12308bde60f4c3]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03214fcd109cf3286]
module.microservice.module.service.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2024-05-20 16:37:42.638 +0000 UTC]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f986d198dd3b9e9d]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0189f0a7ed9c8b1c0]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07da01fd14c162f79]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02d9a8f3d11eef94a]
module.logging.module.s3.aws_s3_bucket_policy.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d07fbe3b003de612]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["document-transfer"]: Refreshing state... [id=cwlsf-795611691]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["doc-transfer-worker"]: Refreshing state... [id=cwlsf-2329394860]
module.logging.aws_cloudwatch_log_subscription_filter.datadog["document-transfer-dns"]: Refreshing state... [id=cwlsf-3260401576]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.ecr["this"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08ef5814b925281221080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02709b47cad88a398]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h]
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-069644483204bfc34]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0744247f7fe9939f3]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b22b1c9cb36ddbf]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07ff470ee8fb30a9c]
module.microservice.data.aws_subnets.private: Reading...
module.microservice.data.aws_subnets.public: Reading...
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0671e05dfe5d637b6]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-089e988da8648dca5]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04a5bc60ca5294ada]
module.microservice.module.service.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-execution]
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.microservice.data.aws_subnets.private: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.microservice.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-4172651141]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.microservice.module.service.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/document-transfer]
module.microservice.module.worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/doc-transfer-worker]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0c4c542a315b431d2]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.microservice.module.worker.data.aws_vpc.current: Reading...
module.microservice.module.service.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.bastion.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d024041e938721e6]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8|terraform-20240826174250995600000003]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h|terraform-20240807163341709200000003]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Reading...
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Reading...
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Reading...
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c71017a2af6cf86a]
module.vpc.aws_route.peer["aptible-rtb-0d07fbe3b003de612"]: Refreshing state... [id=r-rtb-0d07fbe3b003de612368033544]
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Read complete after 0s [id=subnet-07da01fd14c162f79]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Read complete after 0s [id=subnet-0189f0a7ed9c8b1c0]
module.microservice.module.service.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-0771f8e6767f397d5]
module.bastion.random_shuffle.subnet: Refreshing state... [id=-]
module.microservice.module.service.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a66151b2382a2108]
module.microservice.module.database.module.database.aws_security_group.this[0]: Refreshing state... [id=sg-055bc33b714fb9e0c]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-061adafc3727e46a2]
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Read complete after 1s [id=subnet-02d9a8f3d11eef94a]
module.microservice.module.service.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:targetgroup/il-gcc-staging-doc-trans-app/fad70920cdce164a]
module.microservice.module.worker.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01e4acea900d38f64]
module.microservice.module.service.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06ecd1480c288ef2b]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2201565842]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0be8de663ca5375eb]
module.microservice.module.worker.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-execution]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d07fbe3b003de6121080289494]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::891377151751:policy/vpc-flow-log-to-cloudwatch-20240605160034315600000001]
module.bastion.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4151066003]
module.bastion.aws_instance.this: Refreshing state... [id=i-03c8d3f0af8dfd73f]
module.microservice.module.database.module.database.aws_db_subnet_group.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1770175940]
module.microservice.module.worker.data.aws_vpc.current: Read complete after 1s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.microservice.module.service.data.aws_vpc.current: Read complete after 1s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2419688183]
module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002-20240605160034869200000003]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1891798500]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.microservice.module.database.module.database.aws_security_group_rule.this["ingress_cidrs"]: Refreshing state... [id=sgrule-3916256017]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4065028013]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3831811513]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-4192439624]
module.microservice.module.service.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:loadbalancer/app/il-gcc-staging-doc-trans/2cb48b79633f6298]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1269108624]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1670266217]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-40105728]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1972381386]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-038d55d2906b26bf0]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.api"]: Refreshing state... [id=vpce-0664fdd4999c62b98]
module.vpc.module.endpoints.aws_vpc_endpoint.this["guardduty-data"]: Refreshing state... [id=vpce-0e4febb651c64bbf7]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-06fe221fedf7a8bf2]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.dkr"]: Refreshing state... [id=vpce-0093f9b18e02d2a5f]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-09dd677477a50e117]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-contacts"]: Refreshing state... [id=vpce-0e4802fab0b2f69a8]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-0013a4b0521c3e0eb]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-01cd78c1ead4518ae]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-incidents"]: Refreshing state... [id=vpce-07227d23093c910c6]
module.microservice.module.database.module.database.aws_rds_cluster.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/73646a3eca8caaac]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/470d149962ca870a]
module.microservice.module.service.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z02064831UC6N7D03DSNG_staging.document-transfer.cfa.codes_A]
module.microservice.module.database.module.database.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-1]
module.microservice.module.service.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002]
module.microservice.module.worker.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-secrets-access-20240909164643976400000003]
module.microservice.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-doc-transfer-worker/illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.microservice.module.database.module.database.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ engine_version_actual                 = "15.4" -> "15.10"
        id                                    = "illinois-getchildcare-staging-document-transfer"
        tags                                  = {
            "service" = "document-transfer"
        }
        # (46 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.bastion.aws_instance.this must be replaced
+/- resource "aws_instance" "this" {
      ~ ami                                  = "ami-08b5b3a93ed654d19" -> "ami-0953476d60561c955" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:891377151751:instance/i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b4bfad87e0ef1edc" -> (known after apply)
      ~ private_dns                          = "ip-10-0-22-95.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.22.95" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name"    = "illinois-getchildcare-staging-bastion"
            "service" = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ cpu_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ enclave_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ ephemeral_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ instance_market_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ maintenance_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_interface {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ private_dns_name_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-008a2e3956717fd62" -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.hosted_zones.aws_cloudwatch_log_resource_policy.this["document_transfer"] will be destroyed
  # (because aws_cloudwatch_log_resource_policy.this is not in configuration)
  - resource "aws_cloudwatch_log_resource_policy" "this" {
      - id              = "illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes" -> null
      - policy_document = jsonencode(
            {
              - Id        = "Route53 Logging Policy"
              - Statement = [
                  - {
                      - Action    = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "route53.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes",
                          - "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes:*",
                        ]
                      - Sid       = "Allow Route53 to write logs to CloudWatch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_name     = "illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes" -> null
    }

  # module.hosted_zones.aws_route53_query_log.this["document_transfer"] will be destroyed
  # (because aws_route53_query_log.this is not in configuration)
  - resource "aws_route53_query_log" "this" {
      - arn                      = "arn:aws:route53:::queryloggingconfig/fe638ff4-a024-4c13-9df3-3ea796f5fd31" -> null
      - cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes" -> null
      - id                       = "fe638ff4-a024-4c13-9df3-3ea796f5fd31" -> null
      - zone_id                  = "Z02064831UC6N7D03DSNG" -> null
    }

  # module.hosted_zones.aws_route53_zone.this["document_transfer"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Hosted zone for the Document Transfer service."
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "staging.document-transfer.cfa.codes"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "application" = "illinois-getchildcare-staging"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "tofu"        = "true"
        }
      + zone_id             = (known after apply)
    }

  # module.logging.aws_cloudwatch_log_group.logs["document-transfer-dns"] will be destroyed
  # (because key ["document-transfer-dns"] is not in for_each map)
  - resource "aws_cloudwatch_log_group" "logs" {
      - arn               = "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes" -> null
      - id                = "/aws/route53/staging.document-transfer.cfa.codes" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/route53/staging.document-transfer.cfa.codes" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "domain"  = "staging.document-transfer.cfa.codes"
          - "service" = "document-transfer"
          - "use"     = "logging"
        } -> null
      - tags_all          = {
          - "application" = "illinois-getchildcare-staging"
          - "domain"      = "staging.document-transfer.cfa.codes"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "service"     = "document-transfer"
          - "tofu"        = "true"
          - "use"         = "logging"
        } -> null
    }

  # module.logging.aws_cloudwatch_log_subscription_filter.datadog["document-transfer-dns"] will be destroyed
  # (because key ["document-transfer-dns"] is not in for_each map)
  - resource "aws_cloudwatch_log_subscription_filter" "datadog" {
      - destination_arn = "arn:aws:lambda:us-east-1:891377151751:function:DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr" -> null
      - distribution    = "ByLogStream" -> null
      - id              = "cwlsf-3260401576" -> null
      - log_group_name  = "/aws/route53/staging.document-transfer.cfa.codes" -> null
      - name            = "datadog" -> null
    }

  # module.hosted_zones.module.hosted_zones.aws_route53_zone.this["document_transfer"] will be destroyed
  # (because aws_route53_zone.this is not in configuration)
  - resource "aws_route53_zone" "this" {
      - arn                 = "arn:aws:route53:::hostedzone/Z02064831UC6N7D03DSNG" -> null
      - comment             = "Hosted zone for the Document Transfer service." -> null
      - force_destroy       = false -> null
      - id                  = "Z02064831UC6N7D03DSNG" -> null
      - name                = "staging.document-transfer.cfa.codes" -> null
      - name_servers        = [
          - "ns-1087.awsdns-07.org",
          - "ns-143.awsdns-17.com",
          - "ns-1840.awsdns-38.co.uk",
          - "ns-655.awsdns-17.net",
        ] -> null
      - primary_name_server = "ns-1840.awsdns-38.co.uk" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "application" = "illinois-getchildcare-staging"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "tofu"        = "true"
        } -> null
      - zone_id             = "Z02064831UC6N7D03DSNG" -> null
    }

  # module.microservice.module.service.aws_ssm_parameter.version["this"] will be destroyed
  # (because aws_ssm_parameter.version is not in configuration)
  - resource "aws_ssm_parameter" "version" {
      - arn            = "arn:aws:ssm:us-east-1:891377151751:parameter/illinois-getchildcare/staging/document-transfer/version" -> null
      - data_type      = "text" -> null
      - description    = "Current version of illinois-getchildcare - staging document-transfer" -> null
      - id             = "/illinois-getchildcare/staging/document-transfer/version" -> null
      - insecure_value = "latest" -> null
      - name           = "/illinois-getchildcare/staging/document-transfer/version" -> null
      - tags           = {
          - "service" = "document-transfer"
        } -> null
      - tags_all       = {
          - "application" = "illinois-getchildcare-staging"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "service"     = "document-transfer"
          - "tofu"        = "true"
        } -> null
      - tier           = "Standard" -> null
      - type           = "String" -> null
      - version        = 1 -> null
    }

  # module.microservice.module.database.module.database.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
      ~ enabled_cloudwatch_logs_exports       = [
          - "iam-db-auth-error",
          - "instance",
          - "postgresql",
        ]
      - iam_database_authentication_enabled   = true -> null
        id                                    = "illinois-getchildcare-staging-document-transfer"
        tags                                  = {
            "service" = "document-transfer"
        }
        # (45 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.microservice.module.database.module.database.aws_rds_cluster_instance.this["1"] will be destroyed
  # (because key ["1"] is not in for_each map)
  - resource "aws_rds_cluster_instance" "this" {
      - apply_immediately                     = true -> null
      - arn                                   = "arn:aws:rds:us-east-1:891377151751:db:illinois-getchildcare-staging-document-transfer-1" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1b" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - cluster_identifier                    = "illinois-getchildcare-staging-document-transfer" -> null
      - copy_tags_to_snapshot                 = true -> null
      - db_parameter_group_name               = "default.aurora-postgresql15" -> null
      - db_subnet_group_name                  = "illinois-getchildcare-staging-document-transfer" -> null
      - dbi_resource_id                       = "db-2C46OFXSRVQVH7CCATSQK4JJ54" -> null
      - endpoint                              = "illinois-getchildcare-staging-document-transfer-1.clwaskc8ck96.us-east-1.rds.amazonaws.com" -> null
      - engine                                = "aurora-postgresql" -> null
      - engine_version                        = "15.10" -> null
      - engine_version_actual                 = "15.10" -> null
      - force_destroy                         = false -> null
      - id                                    = "illinois-getchildcare-staging-document-transfer-1" -> null
      - identifier                            = "illinois-getchildcare-staging-document-transfer-1" -> null
      - instance_class                        = "db.serverless" -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:891377151751:key/c44eda7e-7b5d-43b1-977e-f4d7e580e0db" -> null
      - monitoring_interval                   = 60 -> null
      - monitoring_role_arn                   = "arn:aws:iam::891377151751:role/il-gcc-staging-doc-trans-db-mon-20250509154744419300000001" -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = true -> null
      - performance_insights_kms_key_id       = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269" -> null
      - performance_insights_retention_period = 7 -> null
      - port                                  = 5432 -> null
      - preferred_backup_window               = "02:00-03:00" -> null
      - preferred_maintenance_window          = "sun:05:00-sun:06:00" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {
          - "service" = "document-transfer"
        } -> null
      - tags_all                              = {
          - "application" = "illinois-getchildcare-staging"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "service"     = "document-transfer"
          - "tofu"        = "true"
        } -> null
      - writer                                = true -> null

      - timeouts {}
    }

  # module.microservice.module.database.module.database.aws_rds_cluster_instance.this["one"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "illinois-getchildcare-staging-document-transfer"
      + copy_tags_to_snapshot                 = true
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "illinois-getchildcare-staging-document-transfer"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "illinois-getchildcare-staging-document-transfer-one"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::891377151751:role/il-gcc-staging-doc-trans-db-mon-20250509154744419300000001"
      + network_type                          = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269"
      + performance_insights_retention_period = 7
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "service" = "document-transfer"
        }
      + tags_all                              = {
          + "application" = "illinois-getchildcare-staging"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.microservice.module.database.module.database.aws_rds_cluster_instance.this["two"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "illinois-getchildcare-staging-document-transfer"
      + copy_tags_to_snapshot                 = true
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "illinois-getchildcare-staging-document-transfer"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "illinois-getchildcare-staging-document-transfer-two"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::891377151751:role/il-gcc-staging-doc-trans-db-mon-20250509154744419300000001"
      + network_type                          = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269"
      + performance_insights_retention_period = 7
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "service" = "document-transfer"
        }
      + tags_all                              = {
          + "application" = "illinois-getchildcare-staging"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.microservice.module.database.module.database.aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:us-east-1:891377151751:security-group/sg-055bc33b714fb9e0c" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-055bc33b714fb9e0c" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.22.0/26",
                  - "10.0.22.128/26",
                  - "10.0.22.64/26",
                ]
              - description      = "Allow ingress from specified CIDR blocks."
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ name                   = "illinois-getchildcare-staging-document-transfer-database--20250509154744419300000002" -> (known after apply)
      ~ name_prefix            = "illinois-getchildcare-staging-document-transfer-database--" -> "illinois-getchildcare-staging-document-transfer-" # forces replacement
      ~ owner_id               = "891377151751" -> (known after apply)
      ~ tags                   = {
          ~ "Name"    = "illinois-getchildcare-staging-document-transfer-database-" -> "illinois-getchildcare-staging-document-transfer"
            "service" = "document-transfer"
        }
      ~ tags_all               = {
          ~ "Name"        = "illinois-getchildcare-staging-document-transfer-database-" -> "illinois-getchildcare-staging-document-transfer"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.microservice.module.database.module.database.aws_security_group_rule.this["ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.0.22.0/26",
          + "10.0.22.128/26",
          + "10.0.22.64/26",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.microservice.module.database.module.database.aws_security_group_rule.this["ingress_cidrs"] will be destroyed
  # (because key ["ingress_cidrs"] is not in for_each map)
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks       = [
          - "10.0.22.0/26",
          - "10.0.22.128/26",
          - "10.0.22.64/26",
        ] -> null
      - description       = "Allow ingress from specified CIDR blocks." -> null
      - from_port         = 5432 -> null
      - id                = "sgrule-3916256017" -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-055bc33b714fb9e0c" -> null
      - self              = false -> null
      - to_port           = 5432 -> null
      - type              = "ingress" -> null
    }

  # module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      - health_check_grace_period_seconds  = 300 -> null
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer"
        name                               = "illinois-getchildcare-staging-document-transfer"
        tags                               = {
            "service" = "document-transfer"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      - health_check_grace_period_seconds  = 300 -> null
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-doc-transfer-worker/illinois-getchildcare-staging-doc-transfer-worker"
        name                               = "illinois-getchildcare-staging-doc-transfer-worker"
        tags                               = {
            "service" = "document-transfer"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 3 to change, 10 to destroy.

Changes to Outputs:
  ~ bastion_instance_id           = "i-03c8d3f0af8dfd73f" -> (known after apply)
  - version_parameter             = "/illinois-getchildcare/staging/document-transfer/version" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```